trade_exp/src/Documents/ГрафикВыходаВодителей/ГрафикВыходаВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2d4584df-31c9-42b8-bfbd-2c116acdb5e2">
  <name>ГрафикВыходаВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="64fbaa50-1e61-49f0-b088-1daf39e07d84">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37a1d8ed-cde0-4f9e-ae42-cc0af8c2d9ed">
    <name>ПланФакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6e851a61-b832-4cee-b13e-5781496ef14d">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2e83ef77-f800-410c-8261-65bf25dc3db5">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="65a55a79-e302-4248-9095-8bcdfac1c18c">
    <name>ПериодРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="c3c20324-641f-4963-a246-2ad974f75c01">
    <name>График</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6558910b-6305-4a65-8122-06b536ff176b">
      <name>Представление17</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="128aecc0-0541-4ebc-b1b1-ac4e3a71420a">
      <name>Представление14</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="05835100-e434-44e1-8c47-b1ea87290a61">
      <name>Представление18</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e58edd9f-2902-4f6c-b937-21cac4fd7788">
      <name>Представление8</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bac0343f-97e6-493c-88f2-f5bfe262ae01">
      <name>Представление20</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e2a22b3d-5867-4555-acd0-7e9301cba0ce">
      <name>Представление10</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1bb321a4-709a-4cc3-b73d-a2fd107b16c8">
      <name>Представление27</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b4ac0ab8-8a7e-4a85-8e7a-56862b7753bb">
      <name>Водитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4e254b46-11cf-4efa-bcab-24dd92a78d08">
      <name>Представление12</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e38f9446-d03b-47dc-8b7c-bef27deb6f7d">
      <name>Автомобиль</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a8d711dc-ec11-44e8-b772-33486173a421">
      <name>Представление7</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="24d9719c-7e75-4d84-a118-dc0a3920a930">
      <name>Представление1</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7b9dbb39-83b0-4ed1-b60a-69abe96dab71">
      <name>Представление2</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c59f8043-f0fa-4a56-bfd3-a59772a94d0e">
      <name>Представление28</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aefea4c3-bd1d-4725-b4d9-da957e3f2626">
      <name>Представление3</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="66a55d56-006d-44a2-a48e-3bee8aa460f8">
      <name>Представление4</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5c5f8a61-05ec-4ab8-a9c5-04134e61d0e1">
      <name>Представление5</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="18983cf0-889a-41d4-a344-2a8e2e044acf">
      <name>Представление6</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b19eabeb-18c7-4aa0-a66c-dcfbf6a46d31">
      <name>Представление11</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4021812b-868f-47dc-844f-b83097fde19f">
      <name>Представление9</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a80889db-52cb-4a0e-ab70-4cf8c82229a4">
      <name>Представление31</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8fa4781b-db2d-4132-83a0-26dd9d4b50b4">
      <name>Представление13</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="642cf82a-f36c-4274-8c2e-3c822f98ea9e">
      <name>Представление15</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b78f1962-a38a-4273-86a1-baafa0fd9874">
      <name>Представление16</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="103ec266-56ae-4cfd-a809-0d88f3953adb">
      <name>КоличествоВыходов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8d76a6a6-3c5b-432f-9e7c-bd1348e4d552">
      <name>Представление26</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d1947ae6-57fa-4a27-8083-65d161796424">
      <name>Представление19</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7878d53c-dd7d-4314-ab6a-0f74becb46c9">
      <name>Представление21</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6b39b437-5d6e-4801-83c0-6c381af113d4">
      <name>Представление22</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4de1fb48-8950-4009-913b-8ff442f6044a">
      <name>Представление23</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2e6224a7-4654-4056-8970-717dbb5aa920">
      <name>Представление24</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8f3837f4-3f97-440f-b3fa-1d61ebcbe603">
      <name>Представление25</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0bb48c47-b607-48d2-9fc4-8f33f244b9fc">
      <name>Представление29</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e260b36e-d3d7-44ba-a2a4-b059b49c89b8">
      <name>Представление30</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>2</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/ГрафикВыходаВодителей/ГрафикВыходаВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1dc2c13f-a1e8-4a9b-be05-c59bff3f7d98">
  <name>ГрафикВыходаВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources extendedConfigurationObject="d7ee4762-06db-4e2a-9bd2-712dd9fb08ba">
    <name>ПлановыйВыход</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="936febe4-e068-4d4e-9f71-8a565889d864">
    <name>ВнеплановыйВыход</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="183664b4-06b2-4bf2-8ebb-2042a04943a0">
    <name>Выходной</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="f029defc-59ea-4fd0-bfa9-b1c1af9cc437">
    <name>НеВыход</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="ba6e4830-6ea7-4c49-9774-b355c4f47e6c">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="dc4dcda7-2404-4f2f-9aef-fbb8af659e03">
    <name>ПланФакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3e3f50ec-5f54-421c-8ce3-56c175b58f66">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/Documents/ГрафикВыходаВодителей/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	
	КолДнейВМес = День(КонецМесяца(ПериодРегистрации));
	
	// регистр ГрафикВыходаВодителей 
	Движения.ГрафикВыходаВодителей.Записывать = Истина;
	Для Каждого ТекСтрокаГрафик Из График Цикл
		Если Не ЗначениеЗаполнено(ТекСтрокаГрафик.Водитель) Тогда
			Продолжить;
		КонецЕсли;
		
		Для сч = 1 По 31 Цикл
			Движение = Движения.ГрафикВыходаВодителей.Добавить();
			Движение.Период = ПериодРегистрации + (сч-1) * 3600 * 24;
			Движение.Подразделение = Подразделение;
			Движение.Водитель = ТекСтрокаГрафик.Водитель;
			Движение.ПланФакт = ПланФакт;
			
			стрЗначение = СокрЛП(ТекСтрокаГрафик["Представление"+сч]);
			Если стрЗначение = "1" Тогда
				Движение.ПлановыйВыход = 1;
			ИначеЕсли  НРег(стрЗначение) = "в1" Тогда
				Движение.ВнеплановыйВыход = 1;
			ИначеЕсли  НРег(стрЗначение) = "в" Тогда
				Движение.Выходной= 1;
			ИначеЕсли  НРег(стрЗначение) = "н" Тогда
				Движение.НеВыход= 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
